//id key等参数配置文件：修改后请点击版本日志后的清除localStorage按钮
var config = {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    // id: '732548980022',
    // key: 'VQMCBwAPAV0GVFBQRVgBBg0BRA',
    server: 'api.zhiyun360.com',

    mac_501: '00:12:4B:00:23:20:69:89', //路灯
    mac_502: '00:12:4B:00:23:20:70:34', //气象站
    // mac_501: '01:12:4B:00:F0:0A:A0:43', //路灯
    // mac_502: '01:12:4B:00:2F:1F:77:B6', //气象站

    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩

    mac_504_1: '00:00:00:00:00:00:00:00', //管网
    mac_504_2: '00:00:00:00:00:00:00:00', //管网
    mac_504_3: '00:00:00:00:00:00:00:00', //管网
    mac_504_4: '00:00:00:00:00:00:00:00', //管网
    mac_504_5: '00:00:00:00:00:00:00:00', //管网
    mac_504_6: '00:00:00:00:00:00:00:00', //管网
    mac_504_7: '00:00:00:00:00:00:00:00', //管网
    mac_504_8: '00:00:00:00:00:00:00:00', //管网
    mac_504_9: '00:00:00:00:00:00:00:00', //管网
    mac_504_10: '00:00:00:00:00:00:00:00', //管网

    mac_505_1: '00:00:00:00:00:00:00:00', //井盖
    mac_505_2: '00:00:00:00:00:00:00:00', //井盖

    mac_506_1: '00:00:00:00:00:00:00:00', //消防栓
    mac_506_2: '00:00:00:00:00:00:00:00', //消防栓

    mac_507: '00:12:4B:00:15:D3:54:5A', //交通灯

    mac_508_1: '00:12:4B:00:23:20:49:BF', //停车
    mac_508_2: '00:00:00:00:00:00:00:00', //停车
    mac_508_3: '00:00:00:00:00:00:00:00', //停车
    mac_508_4: '00:00:00:00:00:00:00:00', //停车

    mac_509: '00:12:4B:00:23:20:54:49', //诱导屏

    mac_715: '01:12:4B:00:B5:40:0C:59', //垃圾桶

    mac_car: '00:00:00:00:00:00:00:00', //小车

    'addr1': "192.168.10.240:28083/Camera:1:34",
    'type1': "ZCamera",
    'user1': "admin",
    'pwd1': "admin",

    'addr2': "192.168.10.240:28083/Camera:1:35",
    'type2': "ZCamera",
    'user2': "admin",
    'pwd2': "admin",

    'addr3': "192.168.10.240:28083/Camera:1:36",
    'type3': "ZCamera",
    'user3': "admin",
    'pwd3': "admin",

    'addr4': "192.168.10.240:28083/Camera:1:37",
    'type4': "ZCamera",
    'user4': "admin",
    'pwd4': "admin",

    'addr5': "192.168.10.240:28083/Camera:1:38",
    'type5': "ZCamera",
    'user5': "admin",
    'pwd5': "admin",
}

var sensor = {
    mac_501: { //智慧路灯
        p100: 'A0', //历史用电量
        p101: 'A1', //电流
        p102: 'A2', //电压
        p103: 'A3', //功率
        p104: 'A4', //人体红外
        p105: 'A5', //光强值
        p106: 'A6',
        p107: 'A7', //倾倒角度
        p108: 'D1', //开关控制 bit0~bit1：LED关(00)、LED一级光(01)、LED二级光(10)、LED三级光(11)
        oneOpen: '{CD1=3,OD1=1,D1=?}',
        twoOpen: '{CD1=3,OD1=2,D1=?}',
        threeOpen: '{CD1=3,OD1=3,D1=?}',
        close: '{CD1=255,D1=?}',
        p109: 'V3', //位置
        query: '{A0=?,A1=?,A2=?,A3=?,A4=?,A5=?,A6=?,A7=?,D1=?,V3=?}',
    },
    mac_502: { //气象站
        p200: 'A0', //温度
        p201: 'A1', //湿度
        p202: 'A2', //大气压力
        p203: 'A3', //PM2.5
        p204: 'A4', //PM10
        p205: 'A5', //噪音
        p206: 'A6', //风速
        p207: 'A7', //风向
        p208: 'D1', //开关控制
        p209: 'V3', //位置
        query: '{A0=?,A1=?,A2=?,A3=?,A4=?,A5=?,A6=?,A7=?,D1=?,V3=?}'
    },
    mac_503: { //充电桩
        p300: 'A0', //历史用电量
        p301: 'A1', //电流
        p302: 'A2', //电压
        p303: 'A3', //功率
        p304: 'A4', //实时负载充电量
        p305: 'A5',
        p306: 'A6', //充电开始时间
        p307: 'A7', //充电结束时间
        p308: 'D1', //开关控制 bit0：关(0)、开(1)
        p309: 'V3', //位置
        open: "{OD1=1,D1=?}",
        close: "{CD1=1,D1=?}",
        query: '{A0=?,A1=?,A2=?,A3=?,A4=?,A5=?,A6=?,A7=?,D1=?,V3=?}'
    },
    mac_504: {
        p400: 'A0', //历史用气
        p401: 'A1', //气压
        p402: 'A2', //燃气浓度
        p403: 'A6', //堵塞
        p404: 'A7', //漏气
        p405: 'D1', //开关控制
        query: '{A0=?,A1=?,A2=?,A6=?,A7=?,D1=?}'
    },
    mac_505: {
        p500: 'A0', //挥发物
        p501: 'A1', //水位
        p502: 'A2', //井盖角度
        p503: 'A6', //水浸状态
        p504: 'A7', //开合状态
        p505: 'D1', //开关控制
        p506: 'V3', //位置
        query: '{A0=?,A1=?,A2=?,A6=?,A7=?,D1=?,V3=?}'
    },
    mac_506: {
        p600: 'A0', //历史用水量
        p601: 'A1', //水压
        p602: 'A6', //用水报警
        p603: 'A7', //倾倒
        p604: 'D1', //开关控制
        p605: 'V3', //经纬度
        query: '{A0=?,A1=?,A2=?A6=?,A7=?,D1=?,V3=?}'
    },
    mac_507: {
        p700: 'A0', //灯1状态，红灯:0,直行:1,左转:2,右转:3
        p701: 'A1', //灯2状态
        p702: 'A2', //灯3状态
        p703: 'A3', //灯4状态
        p704: 'D1', //开关控制
        p705: 'V1', //红绿灯模式
        p706: 'V3', //位置
        query: '{A0=?,A1=?,A2=?,A3=?,A7=?,D1=?,V1=?,V3=?}'
    },
    mac_508: {
        p800: 'A0', //车位1车牌
        p801: 'A1', //车位2车牌
        p802: 'A6', //车位1状态
        p803: 'A7', //车位2状态
        p804: 'D1', //开关控制
        p805: 'V1', //更新车位1车牌
        p806: 'V2', //更新车位2车牌
        p807: 'V3', //位置
        query: '{A0=?,A1=?,A6=?,A7=?,D1=?,V1=?,V2=?,V3=?}'
    },
    mac_509: {
        p900: 'A0', //停车场1空闲车位数
        p901: 'A1', //停车场2空闲车位数
        p902: 'A2', //停车场3空闲车位数
        p903: 'A3', //停车场4空闲车位数
        p904: 'D1', //开关控制
        p905: 'V1', //更新停车场车位空闲状态
        p906: 'V3', //位置
        query: '{A0=?,A1=?,A2=?,A3=?,D1=?,V1=?,V3=?}'
    },
    mac_715: {
        p150: 'A0', //垃圾重量
        p151: 'A1', //垃圾容余
        p152: 'A2', //TVOC
        p153: 'A3', //报警百分比
        p154: 'A4', //识别垃圾种类
        p155: 'A7', //电量
        p156: 'D1', //垃圾桶盖控制
        p157: 'V1', //重量阈值
        p158: 'V2', //容余阈值
        p159: 'V3', //TVOC阈值
        p1510: 'V4', //是否报警
        p1511: 'V5', //位置信息
        query: '{A0=?,A1=?,A2=?,A3=?,A4=?,A7=?,D1=?,V1=?,V2=?,V3=?,V4=?,V5=?}'
    },
    mac_car: {
        car: 'A0', //x&y&z
        query: '{A0=?}'
    }
}
var ai = [
    //百度
    {
        app_id: '22806444',
        api_key: 'I7Xjz2saZmUkGtbEF7ff6D2D',
        secret_key: 'aYy9i3hxIX1uwZKuArFFgdV5cvtZFnz8E'
    },
    //腾讯
    {
        secret_id: '22806445',
        secret_key: 'I7Xjz2saZmUkGtbEF7ff6D2D',
    },
    //旷视
    {
        api_key: 'I7Xjz2saZmUkGtbEF7ff6D2D',
        api_secret: 'aYy9i3hxIX1uwZKuArFFgdV5cvtZFnz8E'
    },
    //讯飞
    {
        api_key: 'I8Xjz2saZmUkGtbE',
        api_secret: 'aYy9i3hxIX1uwZKuArFFgdV5cvtZFnz8E'
    },

]
//八个灯杆
var lampArray = [{
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:12:4B:00:23:20:69:89', //路灯
    mac_502: '00:12:4B:00:23:20:70:34', //气象站
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '732548980022',
    key: 'VQMCBwAPAV0GVFBQRVgBBg0BRA',
    server: 'api.zhiyun360.com',
    mac_501: '01:12:4B:00:F0:0A:A0:43', //路灯
    mac_502: '01:12:4B:00:2F:1F:77:B6', //气象站  
    mac_503_1: '01:12:4B:00:38:61:0C:EF', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:12:4B:00:23:20:69:89', //路灯
    mac_502: '00:12:4B:00:23:20:70:34', //气象站
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:00:00:00:00:00:00:00', //路灯
    mac_502: '00:00:00:00:00:00:00:00', //气象站  
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:00:00:00:00:00:00:00', //路灯
    mac_502: '00:00:00:00:00:00:00:00', //气象站  
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:00:00:00:00:00:00:00', //路灯
    mac_502: '00:00:00:00:00:00:00:00', //气象站  
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:00:00:00:00:00:00:00', //路灯
    mac_502: '00:00:00:00:00:00:00:00', //气象站  
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}, {
    id: '726119987497',
    key: 'DgQAUFMOCgtSAVxUW11ZX1ZKVlZB',
    server: 'api.zhiyun360.com',
    mac_501: '00:00:00:00:00:00:00:00', //路灯
    mac_502: '00:00:00:00:00:00:00:00', //气象站  
    mac_503_1: 'WIFI:0101cfaa1ce4', //充电桩
    mac_503_2: 'WIFI:0201cfaa1ce4', //充电桩
    mac_503_3: 'WIFI:0301cfaa1ce4', //充电桩
    mac_503_4: 'WIFI:0401cfaa1ce4', //充电桩
}]